# https://github.com/ephur/zshrc/blob/master/antibody_plugins_darwin.txt

# oh-my-zsh plugins
# oh-my-zsh root is omitted in favor of prompt and manual definition of a couple of exports
robbyrussell/oh-my-zsh path:plugins/gitfast
# TODO customize fasd loader to eliminate some of the custom aliases I don't like
robbyrussell/oh-my-zsh path:plugins/fasd
robbyrussell/oh-my-zsh path:plugins/ripgrep
robbyrussell/oh-my-zsh path:lib/termsupport.zsh
robbyrussell/oh-my-zsh path:lib/spectrum.zsh

# definitely keeping
mafredri/zsh-async
zsh-users/zsh-completions
zsh-users/zsh-autosuggestions

# experimental
djui/alias-tips # tipz is another plugin here
junegunn/fzf path:shell/key-bindings.zsh
junegunn/fzf path:shell/completion.zsh
caarlos0/ports
Aloxaf/fzf-tab
bigH/git-fuzzy kind:path path:bin

# disabled
# does not work with zsh-autocomplete https://github.com/ohmyzsh/ohmyzsh/pull/7887
# robbyrussell/oh-my-zsh path:plugins/safe-paste

# must load last
sindresorhus/pure
zdharma/fast-syntax-highlighting
zsh-users/zsh-history-substring-search