# A subset of packages that are safe to install on both macos and linux and documented in this Brewfile
# the goal is to provide a common of set of utilities that can be installed on a macos or linux (codespace) machine

# == General Utilities
brew "git"
brew "lynx"
brew "rename"
brew "wget"
brew "ngrep" # network grep
brew "optipng"
brew "iftop"
brew "lftp"
brew "hub"
brew "httpie"
brew "awscli"
brew "ansible"
tap "heroku/brew"
brew "heroku/brew/heroku"
brew "cloc" # code analytics
brew "jq"
brew "q" # sql on csv
brew "dsq" # sql over json and other formats
brew "yq" # yq for yaml and others
brew "dasel" # consistent language for extracting data from XML, CSV, and others. No aggregates.
brew "brimdata/tap/zq" # faster/better jq, has aggregates
brew "hey"
brew "gh"
brew "htmlq"
brew "xsv"
brew "dust"

# == Shell productivity utilities
brew "zsh"
brew "ripgrep"
brew "entr"
brew "prettyping"
brew "less"
brew "nano"
brew "fd" # find
brew "yank"
brew "tldr"
brew "fasd"
brew "fzf"
brew "diff-so-fancy" # diff replacement
brew "git-delta" # diff replacement
brew "bat" # cat, can also do paging
brew "exa" # ls
brew "tmux"
brew "reattach-to-user-namespace"
brew "urlview"
brew "tre-command"
brew "terminal-notifier" # for `zsh-notify`
brew "zinit"
brew "procs" # ps
brew "sd" # sed
# brew "svn" # for `zinit ice svn`
brew "dog" # dig replacement
brew "moreutils" # sponge

# == Experimental
tap "afnanenayet/tap"
brew "afnanenayet/tap/diffsitter"