activitywatch.aw-watcher-vscode
adamwalzer.string-converter
adamzapasnik.credo-linter
akamud.vscode-theme-onedark
benvp.vscode-hex-pm-intellisense
bmewburn.vscode-intelephense-client
castwide.solargraph
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
deerawan.vscode-dash
dkundel.vscode-new-file
eamodio.gitlens
earshinov.permute-lines
EditorConfig.EditorConfig
eg2.vscode-npm-script
esbenp.prettier-vscode
ezforo.copy-relative-path-and-line-numbers
firsttris.vscode-jest-runner
florinpatrascu.vscode-elixir-snippets
GitHub.codespaces
GitHub.copilot-labs
GitHub.copilot-nightly
GitHub.remotehub
GitHub.vscode-pull-request-github
Gruntfuggly.todo-tree
hbenl.vscode-test-explorer
HookyQR.beautify
IBM.output-colorizer
idleberg.applescript
JakeBecker.elixir-ls
kaiwood.endwise
lextudio.restructuredtext
lindraupe.aw-watcher-vscode
mechatroner.rainbow-csv
mikestead.dotenv
mjmcloug.vscode-elixir
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
octref.vetur
patbenatar.advanced-new-file
pgourlain.erlang
pmneo.tsimporter
rebornix.ruby
redhat.vscode-commons
redhat.vscode-yaml
ryanolsonx.solarized
sleistner.vscode-fileutils
stefanjarina.vscode-eex-snippets
streetsidesoftware.code-spell-checker
tombonnike.vscode-status-bar-format-toggle
trond-snekvik.simple-rst
TysonAndre.php-phan
v4run.transpose
vscode-exunit.exunit
Vue.volar
wayou.vscode-todo-highlight
wingrunr21.vscode-ruby
xdebug.php-debug
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
ziyasal.vscode-open-in-github
