# util
dkundel.vscode-new-file
earshinov.permute-lines
EditorConfig.EditorConfig
esbenp.prettier-vscode
HookyQR.beautify
v4run.transpose
adamwalzer.string-converter
IBM.output-colorizer
christian-kohler.path-intellisense
CoenraadS.bracket-pair-colorizer
wmaurer.change-case
sleistner.vscode-fileutils
streetsidesoftware.code-spell-checker

zhuangtongfa.material-theme
akamud.vscode-theme-onedark

# misc languages
DavidAnson.vscode-markdownlint
mikestead.dotenv
ms-python.python
VisualStudioExptTeam.vscodeintellicode
redhat.vscode-yaml

# javascript
christian-kohler.npm-intellisense
eg2.vscode-npm-script
firsttris.vscode-jest-runner

# elixir
dbaeumer.vscode-eslint
JakeBecker.elixir-ls
mjmcloug.vscode-elixir
stefanjarina.vscode-eex-snippets

# ruby
rebornix.ruby
ryanolsonx.solarized
wingrunr21.vscode-ruby
castwide.solargraph
kaiwood.endwise
miguel-savignano.ruby-symbols

# git
eamodio.gitlens
ziyasal.vscode-open-in-github
