adamwalzer.string-converter
bung87.rails
bung87.vscode-gemfile
content-platform.mkt-liquid
dbaeumer.vscode-eslint
eamodio.gitlens
earshinov.permute-lines
EditorConfig.EditorConfig
errata-ai.vale-server
esbenp.prettier-vscode
ezforo.copy-relative-path-and-line-numbers
github.copilot-labs
github.copilot-nightly
GitHub.vscode-pull-request-github
hashicorp.terraform
Hridoy.rails-snippets
ionutvmi.path-autocomplete
jinhyuk.replace-curly-quotes
kaiwood.endwise
mgmcdermott.vscode-language-babel
miguel-savignano.ruby-symbols
mikestead.dotenv
misogi.ruby-rubocop
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vsliveshare.vsliveshare
patbenatar.advanced-new-file
rebornix.ruby
redhat.vscode-commons
redhat.vscode-xml
redhat.vscode-yaml
robert.ruby-snippet
Rubymaniac.vscode-paste-and-indent
ryanolsonx.solarized
sleistner.vscode-fileutils
streetsidesoftware.code-spell-checker
timonwong.shellcheck
v4run.transpose
wayou.vscode-todo-highlight
wingrunr21.vscode-ruby
wmaurer.change-case
zhuangtongfa.material-theme
ziyasal.vscode-open-in-github